# ConfusingSweepByElementsInDesignOptionWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DesignOptionFailures..::..ConfusingSweepByElementsInDesignOptionWarn Property
BuiltInFailures..::..DesignOptionFailures Class See Also
---
A sweep in the main model cannot be hosted by an element in a Design Option [--if you continue it will not be added to the design option set].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ConfusingSweepByElementsInDesignOptionWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConfusingSweepByElementsInDesignOptionWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ConfusingSweepByElementsInDesignOptionWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DesignOptionFailures Class
Autodesk.Revit.DB Namespace